{"config": [{"config": {"name": "global_average_pooling2d_1", "trainable": true, "batch_input_shape": [null, 5, 5, 2048], "dtype": "float32", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "units": 133, "trainable": true, "bias_constraint": null, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential"}